# Brewfile - macOS only (Linux м„ңлІ„м—җм„ңлҠ” .chezmoiignoreлЎң м ңмҷёлҗЁ)

# Taps
tap "laishulu/homebrew"

# CLI Tools
brew "awscli"
brew "bat"
brew "delta"
brew "eza"
brew "fastfetch"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "git-crypt"
brew "git-lfs"
brew "gitleaks"
brew "jq"
brew "lazygit"
brew "neovim"
brew "node"
brew "pnpm"
brew "pipx"
brew "python@3.12"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "zoxide"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "laishulu/homebrew/macism"

# Languages & Runtimes
brew "cocoapods"
brew "firebase-cli"
brew "gemini-cli"
brew "openjdk@17"

# Data
brew "redis", restart_service: :changed

# Fonts
cask "font-meslo-lg-nerd-font"

# Casks
cask "android-studio"
cask "flutter"
cask "copilot-cli"
cask "gcloud-cli"
cask "ghostty"
cask "keycastr"
cask "reactotron"
