# Taps
tap "laishulu/homebrew"

# CLI Tools
brew "awscli"
brew "fd"
brew "gh"
brew "git"
brew "git-lfs"
brew "lazygit"
brew "neovim"
brew "node"
brew "pnpm"
brew "pipx"
brew "python@3.12"
brew "ripgrep"
brew "starship"
brew "tmux"
brew "tree"
brew "laishulu/homebrew/macism"

# Languages & Runtimes
brew "cocoapods"
brew "gemini-cli"
brew "openjdk@17"

# Data
brew "redis", restart_service: :changed

# Casks
cask "claude-code"
cask "copilot-cli"
cask "ghostty"
cask "keycastr"
cask "reactotron"
